Revit 2025 API
Reference.ConvertToStableRepresentation Method
Converts the reference to a stable String representation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public string ConvertToStableRepresentation(
	Document document
)
Public Function ConvertToStableRepresentation (
	document As Document
) As String
public:
String^ ConvertToStableRepresentation(
	Document^ document
)
member ConvertToStableRepresentation :
        document : Document -> string
Parameters
document Document
The document.
Return Value
String
Exceptions
Exception | Condition
ArgumentNullException | document was null.
InvalidObjectException | Reference contained element ids not found in this document.
Remarks
The stable representation can be used to preserve and restore the reference later in the same Revit session or even in a different session where the same document is present. Use ParseFromStableRepresentation(Document, String) to restore the reference. The representation is based on the internal Revit structure and is not intended to be parsed expect by ParseFromStableRepresentation(Document, String).
Example
public string SerializeReference(Document doc, Reference reference)
{
    String ids = String.Empty;
    ids = reference.ConvertToStableRepresentation(doc);
    TaskDialog.Show("SerializeReference", "Representation:\n" + ids);
    return ids;
}
Public Function SerializeReference(doc As Document, reference As Reference) As String
    Dim ids As [String] = [String].Empty
    ids = reference.ConvertToStableRepresentation(doc)
    TaskDialog.Show("SerializeReference", "Representation:" & vbLf + ids)
    Return ids
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace